MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA702/mcu.h
#define _CCP4CON2H_AUXOUT0_POSITION              0x00000003
#define _CCP4CON2H_AUXOUT0_MASK                  0x00000008
#define _CCP4CON2H_AUXOUT0_LENGTH                0x00000001

#define _CCP4CON2H_AUXOUT1_POSITION              0x00000004
#define _CCP4CON2H_AUXOUT1_MASK                  0x00000010
#define _CCP4CON2H_AUXOUT1_LENGTH                0x00000001

#define _CCP4CON2H_ICGSM0_POSITION               0x00000006
#define _CCP4CON2H_ICGSM0_MASK                   0x00000040
#define _CCP4CON2H_ICGSM0_LENGTH                 0x00000001

#define _CCP4CON2H_ICGSM1_POSITION               0x00000007
#define _CCP4CON2H_ICGSM1_MASK                   0x00000080
#define _CCP4CON2H_ICGSM1_LENGTH                 0x00000001

#define _CCP4CON2H_ICSEL_POSITION                0x00000000
#define _CCP4CON2H_ICSEL_MASK                    0x00000007
#define _CCP4CON2H_ICSEL_LENGTH                  0x00000003

#define _CCP4CON2H_ICSEL0_POSITION               0x00000000
#define _CCP4CON2H_ICSEL0_MASK                   0x00000001
#define _CCP4CON2H_ICSEL0_LENGTH                 0x00000001

#define _CCP4CON2H_ICSEL1_POSITION               0x00000001
#define _CCP4CON2H_ICSEL1_MASK                   0x00000002
#define _CCP4CON2H_ICSEL1_LENGTH                 0x00000001

#define _CCP4CON2H_ICSEL2_POSITION               0x00000002
#define _CCP4CON2H_ICSEL2_MASK                   0x00000004
#define _CCP4CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP4CON3H_PSSBDF_POSITION               0x00000000
#define _CCP4CON3H_PSSBDF_MASK                   0x00000003
#define _CCP4CON3H_PSSBDF_LENGTH                 0x00000002

#define _CCP4CON3H_PSSACE_POSITION               0x00000002
#define _CCP4CON3H_PSSACE_MASK                   0x0000000C
#define _CCP4CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP4CON3H_POLBDF_POSITION               0x00000004
#define _CCP4CON3H_POLBDF_MASK                   0x00000010
#define _CCP4CON3H_POLBDF_LENGTH                 0x00000001

#define _CCP4CON3H_POLACE_POSITION               0x00000005
#define _CCP4CON3H_POLACE_MASK                   0x00000020
#define _CCP4CON3H_POLACE_LENGTH                 0x00000001

#define _CCP4CON3H_OUTM_POSITION                 0x00000008
#define _CCP4CON3H_OUTM_MASK                     0x00000700
#define _CCP4CON3H_OUTM_LENGTH                   0x00000003

#define _CCP4CON3H_OSCNT_POSITION                0x0000000C
#define _CCP4CON3H_OSCNT_MASK                    0x00007000
#define _CCP4CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP4CON3H_OETRIG_POSITION               0x0000000F
#define _CCP4CON3H_OETRIG_MASK                   0x00008000
#define _CCP4CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP4CON3H_PSSBDF0_POSITION              0x00000000
#define _CCP4CON3H_PSSBDF0_MASK                  0x00000001
#define _CCP4CON3H_PSSBDF0_LENGTH                0x00000001

#define _CCP4CON3H_PSSBDF1_POSITION              0x00000001
#define _CCP4CON3H_PSSBDF1_MASK                  0x00000002
#define _CCP4CON3H_PSSBDF1_LENGTH                0x00000001

#define _CCP4CON3H_PSSACE0_POSITION              0x00000002
#define _CCP4CON3H_PSSACE0_MASK                  0x00000004
#define _CCP4CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP4CON3H_PSSACE1_POSITION              0x00000003
#define _CCP4CON3H_PSSACE1_MASK                  0x00000008
#define _CCP4CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP4CON3H_OUTM0_POSITION                0x00000008
#define _CCP4CON3H_OUTM0_MASK                    0x00000100
#define _CCP4CON3H_OUTM0_LENGTH                  0x00000001

#define _CCP4CON3H_OUTM1_POSITION                0x00000009
#define _CCP4CON3H_OUTM1_MASK                    0x00000200
#define _CCP4CON3H_OUTM1_LENGTH                  0x00000001

#define _CCP4CON3H_OUTM2_POSITION                0x0000000A
#define _CCP4CON3H_OUTM2_MASK                    0x00000400
#define _CCP4CON3H_OUTM2_LENGTH                  0x00000001

#define _CCP4CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP4CON3H_OSCNT0_MASK                   0x00001000
#define _CCP4CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP4CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP4CON3H_OSCNT1_MASK                   0x00002000
#define _CCP4CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP4CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP4CON3H_OSCNT2_MASK                   0x00004000
#define _CCP4CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP4STAT_ICBNE_POSITION                 0x00000000
#define _CCP4STAT_ICBNE_MASK                     0x00000001
#define _CCP4STAT_ICBNE_LENGTH                   0x00000001

#define _CCP4STAT_ICOV_POSITION                  0x00000001
#define _CCP4STAT_ICOV_MASK                      0x00000002
#define _CCP4STAT_ICOV_LENGTH                    0x00000001

#define _CCP4STAT_ICDIS_POSITION                 0x00000002
#define _CCP4STAT_ICDIS_MASK                     0x00000004
#define _CCP4STAT_ICDIS_LENGTH                   0x00000001

#define _CCP4STAT_SCEVT_POSITION                 0x00000003
#define _CCP4STAT_SCEVT_MASK                     0x00000008
#define _CCP4STAT_SCEVT_LENGTH                   0x00000001

#define _CCP4STAT_ASEVT_POSITION                 0x00000004
#define _CCP4STAT_ASEVT_MASK                     0x00000010
#define _CCP4STAT_ASEVT_LENGTH                   0x00000001

#define _CCP4STAT_TRCLR_POSITION                 0x00000005
#define _CCP4STAT_TRCLR_MASK                     0x00000020
#define _CCP4STAT_TRCLR_LENGTH                   0x00000001

#define _CCP4STAT_TRSET_POSITION                 0x00000006
#define _CCP4STAT_TRSET_MASK                     0x00000040
#define _CCP4STAT_TRSET_LENGTH                   0x00000001

#define _CCP4STAT_CCPTRIG_POSITION               0x00000007
#define _CCP4STAT_CCPTRIG_MASK                   0x00000080
#define _CCP4STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP4STAT_ICGARM_POSITION                0x0000000A
#define _CCP4STAT_ICGARM_MASK                    0x00000400
#define _CCP4STAT_ICGARM_LENGTH                  0x00000001

