MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA702/mcu.h
#define _U1WTCL_WTC12_POSITION                   0x0000000C
#define _U1WTCL_WTC12_MASK                       0x00001000
#define _U1WTCL_WTC12_LENGTH                     0x00000001

#define _U1WTCL_WTC13_POSITION                   0x0000000D
#define _U1WTCL_WTC13_MASK                       0x00002000
#define _U1WTCL_WTC13_LENGTH                     0x00000001

#define _U1WTCL_WTC14_POSITION                   0x0000000E
#define _U1WTCL_WTC14_MASK                       0x00004000
#define _U1WTCL_WTC14_LENGTH                     0x00000001

#define _U1WTCL_WTC15_POSITION                   0x0000000F
#define _U1WTCL_WTC15_MASK                       0x00008000
#define _U1WTCL_WTC15_LENGTH                     0x00000001

#define _U1WTCH_WTCH_POSITION                    0x00000000
#define _U1WTCH_WTCH_MASK                        0x000000FF
#define _U1WTCH_WTCH_LENGTH                      0x00000008

#define _U1WTCH_WTC16_POSITION                   0x00000000
#define _U1WTCH_WTC16_MASK                       0x00000001
#define _U1WTCH_WTC16_LENGTH                     0x00000001

#define _U1WTCH_WTC17_POSITION                   0x00000001
#define _U1WTCH_WTC17_MASK                       0x00000002
#define _U1WTCH_WTC17_LENGTH                     0x00000001

#define _U1WTCH_WTC18_POSITION                   0x00000002
#define _U1WTCH_WTC18_MASK                       0x00000004
#define _U1WTCH_WTC18_LENGTH                     0x00000001

#define _U1WTCH_WTC19_POSITION                   0x00000003
#define _U1WTCH_WTC19_MASK                       0x00000008
#define _U1WTCH_WTC19_LENGTH                     0x00000001

#define _U1WTCH_WTC20_POSITION                   0x00000004
#define _U1WTCH_WTC20_MASK                       0x00000010
#define _U1WTCH_WTC20_LENGTH                     0x00000001

#define _U1WTCH_WTC21_POSITION                   0x00000005
#define _U1WTCH_WTC21_MASK                       0x00000020
#define _U1WTCH_WTC21_LENGTH                     0x00000001

#define _U1WTCH_WTC22_POSITION                   0x00000006
#define _U1WTCH_WTC22_MASK                       0x00000040
#define _U1WTCH_WTC22_LENGTH                     0x00000001

#define _U1WTCH_WTC23_POSITION                   0x00000007
#define _U1WTCH_WTC23_MASK                       0x00000080
#define _U1WTCH_WTC23_LENGTH                     0x00000001

#define _U2MODE_STSEL_POSITION                   0x00000000
#define _U2MODE_STSEL_MASK                       0x00000001
#define _U2MODE_STSEL_LENGTH                     0x00000001

#define _U2MODE_PDSEL_POSITION                   0x00000001
#define _U2MODE_PDSEL_MASK                       0x00000006
#define _U2MODE_PDSEL_LENGTH                     0x00000002

#define _U2MODE_BRGH_POSITION                    0x00000003
#define _U2MODE_BRGH_MASK                        0x00000008
#define _U2MODE_BRGH_LENGTH                      0x00000001

#define _U2MODE_URXINV_POSITION                  0x00000004
#define _U2MODE_URXINV_MASK                      0x00000010
#define _U2MODE_URXINV_LENGTH                    0x00000001

#define _U2MODE_ABAUD_POSITION                   0x00000005
#define _U2MODE_ABAUD_MASK                       0x00000020
#define _U2MODE_ABAUD_LENGTH                     0x00000001

#define _U2MODE_LPBACK_POSITION                  0x00000006
#define _U2MODE_LPBACK_MASK                      0x00000040
#define _U2MODE_LPBACK_LENGTH                    0x00000001

#define _U2MODE_WAKE_POSITION                    0x00000007
#define _U2MODE_WAKE_MASK                        0x00000080
#define _U2MODE_WAKE_LENGTH                      0x00000001

#define _U2MODE_UEN_POSITION                     0x00000008
#define _U2MODE_UEN_MASK                         0x00000300
#define _U2MODE_UEN_LENGTH                       0x00000002

#define _U2MODE_RTSMD_POSITION                   0x0000000B
#define _U2MODE_RTSMD_MASK                       0x00000800
#define _U2MODE_RTSMD_LENGTH                     0x00000001

#define _U2MODE_IREN_POSITION                    0x0000000C
#define _U2MODE_IREN_MASK                        0x00001000
#define _U2MODE_IREN_LENGTH                      0x00000001

#define _U2MODE_USIDL_POSITION                   0x0000000D
#define _U2MODE_USIDL_MASK                       0x00002000
#define _U2MODE_USIDL_LENGTH                     0x00000001

#define _U2MODE_UARTEN_POSITION                  0x0000000F
#define _U2MODE_UARTEN_MASK                      0x00008000
#define _U2MODE_UARTEN_LENGTH                    0x00000001

#define _U2MODE_PDSEL0_POSITION                  0x00000001
#define _U2MODE_PDSEL0_MASK                      0x00000002
#define _U2MODE_PDSEL0_LENGTH                    0x00000001

#define _U2MODE_PDSEL1_POSITION                  0x00000002
#define _U2MODE_PDSEL1_MASK                      0x00000004
#define _U2MODE_PDSEL1_LENGTH                    0x00000001

#define _U2MODE_RXINV_POSITION                   0x00000004
#define _U2MODE_RXINV_MASK                       0x00000010
#define _U2MODE_RXINV_LENGTH                     0x00000001

#define _U2MODE_UEN0_POSITION                    0x00000008
#define _U2MODE_UEN0_MASK                        0x00000100
#define _U2MODE_UEN0_LENGTH                      0x00000001

#define _U2MODE_UEN1_POSITION                    0x00000009
#define _U2MODE_UEN1_MASK                        0x00000200
#define _U2MODE_UEN1_LENGTH                      0x00000001

#define _U2STA_URXDA_POSITION                    0x00000000
#define _U2STA_URXDA_MASK                        0x00000001
#define _U2STA_URXDA_LENGTH                      0x00000001

#define _U2STA_OERR_POSITION                     0x00000001
#define _U2STA_OERR_MASK                         0x00000002
#define _U2STA_OERR_LENGTH                       0x00000001

#define _U2STA_FERR_POSITION                     0x00000002
#define _U2STA_FERR_MASK                         0x00000004
#define _U2STA_FERR_LENGTH                       0x00000001

#define _U2STA_PERR_POSITION                     0x00000003
#define _U2STA_PERR_MASK                         0x00000008
#define _U2STA_PERR_LENGTH                       0x00000001

#define _U2STA_RIDLE_POSITION                    0x00000004
#define _U2STA_RIDLE_MASK                        0x00000010
#define _U2STA_RIDLE_LENGTH                      0x00000001

#define _U2STA_ADDEN_POSITION                    0x00000005
#define _U2STA_ADDEN_MASK                        0x00000020
#define _U2STA_ADDEN_LENGTH                      0x00000001

