MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA702/mcu.h
#define POSCMD_EC            0x00FC
#define POSCMD_XT            0x00FD
#define POSCMD_HS            0x00FE
#define POSCMD_NONE          0x00FF

#define OSCIOFCN_ON          0x00FB
#define OSCIOFCN_OFF         0x00FF

#define SOSCSEL_OFF          0x00F7
#define SOSCSEL_ON           0x00FF

#define PLLSS_PLL_FRC        0x00EF
#define PLLSS_PLL_PRI        0x00FF

#define IOL1WAY_OFF          0x00DF
#define IOL1WAY_ON           0x00FF

#define FCKSM_CSECME         0x003F
#define FCKSM_CSECMD         0x007F
#define FCKSM_CSDCMD         0x00BF

/* Register FWDT (0x2af20)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0x2af20),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscaler bits:
**     WDTPS_PS1            1:1
**     WDTPS_PS2            1:2
**     WDTPS_PS4            1:4
**     WDTPS_PS8            1:8
**     WDTPS_PS16           1:16
**     WDTPS_PS32           1:32
**     WDTPS_PS64           1:64
**     WDTPS_PS128          1:128
**     WDTPS_PS256          1:256
**     WDTPS_PS512          1:512
**     WDTPS_PS1024         1:1,024
**     WDTPS_PS2048         1:2,048
**     WDTPS_PS4096         1:4,096
**     WDTPS_PS8192         1:8,192
**     WDTPS_PS16384        1:16,384
**     WDTPS_PS32768        1:32,768
**
**   Watchdog Timer Prescaler bit:
**     FWPSA_PR32           1:32
**     FWPSA_PR128          1:128
**
**   Watchdog Timer Enable bits:
**     FWDTEN_OFF           WDT and SWDTEN disabled
**     FWDTEN_ON_DIS_SLEEP  WDT Enabled only while device is active (disabled in sleep, SWDTEN disabled)
**     FWDTEN_ON_SWDTEN     WDT Enabled/Disabled (controlled using SWDTEN bit)
**     FWDTEN_ON            WDT Enabled
**
**   Watchdog Timer Window Enable bit:
**     WINDIS_ON            Watchdog Timer in Window mode
**     WINDIS_OFF           Watchdog Timer in Non-Window mode
**
**   Watchdog Timer Window Select bits:
**     WDTWIN_WIN75         WDT Windo is 75% of WDT period
**     WDTWIN_WIN50         WDT Window is 50% of WDT period
**     WDTWIN_WIN37         WDT Window is 37.5% of WDT period
**     WDTWIN_WIN25         WDT Window is 25% of WDT period
**
**   WDT MUX Source Select bits:
**     WDTCMX_LPRC          WDT always uses LPRC as its clock source
**     WDTCMX_WDTCLK        WDT clock source is determined by the WDTCLK Configuration bits
**
**   WDT Clock Source Select bits:
**     WDTCLK_SYSCLK        WDT uses system clock when active, LPRC while in Sleep mode
**     WDTCLK_SOSC          WDT uses SOSC inpu
**     WDTCLK_FRC           WDT uses 31 kHz source from FRC when active in Windowed WDT
**     WDTCLK_LPRC          WDT uses LPRC
**
*/

#define WDTPS_PS1            0x6BF0
#define WDTPS_PS2            0x6BF1
#define WDTPS_PS4            0x6BF2
#define WDTPS_PS8            0x6BF3
#define WDTPS_PS16           0x6BF4
#define WDTPS_PS32           0x6BF5
#define WDTPS_PS64           0x6BF6
#define WDTPS_PS128          0x6BF7
#define WDTPS_PS256          0x6BF8
#define WDTPS_PS512          0x6BF9
#define WDTPS_PS1024         0x6BFA
#define WDTPS_PS2048         0x6BFB
#define WDTPS_PS4096         0x6BFC
#define WDTPS_PS8192         0x6BFD
#define WDTPS_PS16384        0x6BFE
#define WDTPS_PS32768        0x6BFF

#define FWPSA_PR32           0x6BEF
#define FWPSA_PR128          0x6BFF

#define FWDTEN_OFF           0x6B9F
#define FWDTEN_ON_DIS_SLEEP  0x6BBF
#define FWDTEN_ON_SWDTEN     0x6BDF
#define FWDTEN_ON            0x6BFF

#define WINDIS_ON            0x6B7F
#define WINDIS_OFF           0x6BFF

#define WDTWIN_WIN75         0x68FF
#define WDTWIN_WIN50         0x69FF
#define WDTWIN_WIN37         0x6AFF
#define WDTWIN_WIN25         0x6BFF

#define WDTCMX_LPRC          0x63FF
#define WDTCMX_WDTCLK        0x6BFF

#define WDTCLK_SYSCLK        0x0BFF
#define WDTCLK_SOSC          0x2BFF
#define WDTCLK_FRC           0x4BFF
#define WDTCLK_LPRC          0x6BFF

/* Register FPOR (0x2af24)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0x2af24),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Brown Out Enable bit:
**     BOREN_OFF            Brown Out Disabled
**     BOREN_SBOREN         Controlled by SBOREN
**     BOREN_NO_SLEEP       Disabled for Sleep Modes
**     BOREN_ON             Brown Out Enable Bit
**
**   Low power regulator control:
**     LPCFG_ON             Retention Sleep controlled by RETEN
**     LPCFG_OFF            No Retention Sleep
**
**   Downside Voltage Protection Enable bit:
**     DNVPEN_DISABLE       Downside protection disabled when BOR is inactive
**     DNVPEN_ENABLE        Downside protection enabled using ZPBOR when BOR is inactive
**
*/

#define BOREN_OFF            0x000C
#define BOREN_SBOREN         0x000D
#define BOREN_NO_SLEEP       0x000E
#define BOREN_ON             0x000F

#define LPCFG_ON             0x000B
#define LPCFG_OFF            0x000F

#define DNVPEN_DISABLE       0x0007
#define DNVPEN_ENABLE        0x000F

/* Register FICD (0x2af28)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x2af28),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

